In this document I'll be exploring the awesomeness of dlopen.

dlopen is used to load a shared object into memory.  Shared object files => .so. Ok lets get started!

** Results: Success 
#+begin_src sh :results output
echo "Create binary"
g++ src/dlopen.cpp -rdynamic -std=c++11 -ldl -o src/dlopen
echo "Create shared object file"
g++ -c src/test.cpp -o src/test.o
g++ -shared src/test.o -o src/test.so
echo "-- Running ldopen --"
./src/dlopen
echo "-- Done --"
rm src/dlopen src/test.o src/test.so
#+end_src 

#+RESULTS:
: Create binary
: Create shared object file
: -- Running ldopen --
: Hello world!
: -- Done --
* Next level: A binary that dynamically creates a new .so file,  links it, and executes a function from it
The next thing I'm interested in doing is getting a binary to write some c++ out to a file. The file will then get compiled into a .so which will then be loaded via dlopen. I'll then try to execute some function provided by the shared object file.

I've used popen to manage execution system commands. For a proper solution I'd be looking to remove popen and replace it with something more safe.

#+begin_src cpp :flags src/createSo.cpp -o createSo -std=c++11 -ldl :tangle yes :tangle src/createSo.cpp
#include <iostream>
#include <dlfcn.h>
#include <string>
#include <sstream>
#include <fstream>
#include <unistd.h>
#include <stdlib.h>
using namespace std;

// Not heaps happy with this little function
bool RunSystemFunction(const char* cmd)
{
    FILE* fp = nullptr;
    int status; 
    char path[1000];
    fp = popen(cmd, "r");
    if (!fp)
    {   
        std::cerr << "Failed to run command: " << cmd << std::endl;
        return false;
    }   
    
    while (fgets(path, sizeof(path)-1, fp) != NULL)
    {   
        std::cout << path;
    }   
    return true;
}

int main(int, char**)
{
    std::cout << "input valid C++: ";
    std::string cpp;
    std::getline(cin, cpp);

    std::stringstream ss; 
    ss  << "#include <iostream>\n"
        << "extern \"C\" void entrypoint()\n"
        << "{\n"
        << cpp << ";\n"
        << "}" ;
    std::ofstream tmpCppFile;
    tmpCppFile.open("src/tmpCppFile.cpp", std::ios::out);
    tmpCppFile << ss.str();
    tmpCppFile.close();

    // I need to find a better way to call a sub process. I don't like that I'm basicly exec'ing
    // this is not good practice
    if (!RunSystemFunction("/usr/bin/g++ -c src/tmpCppFile.cpp -o src/tmpCppFile.o")) return 1;
    if (!RunSystemFunction("/usr/bin/g++ -shared src/tmpCppFile.o -o src/tmpCppFile.so")) return 1;

    // handle is a void* pointer
    auto handle = dlopen("./src/tmpCppFile.so", RTLD_LAZY);
    if (!handle)
    {   
        std::cout << "error: " << dlerror() << std::endl;
        return 1;
    }   
    // This call to dlerror is meant to clear any remaining errors
    // it looks really clunky. I wish I didn;t have to call this 
    // if the handle is not NULL
    dlerror(); 

    // create a function pointer handle
    void (*test)();
    *(void**)(&test) = dlsym(handle, "entrypoint");

    auto error = dlerror();
    if(error != nullptr)
    {   
        std::cout << "error: " << error << std::endl;
    }   

    (*test)();
    dlclose(handle);
    return 0;
}
#+end_src 

#+begin_src sh :results output raw
g++ -rdynamic src/createSo.cpp -o createSo -std=c++11 -ldl -o src/createSo
echo "std::cout << \"\n7 x 9 = \" << 7*9 << std::endl" | ./src/createSo
rm src/createSo src/tmpCppFile.so src/tmpCppFile.o
#+end_src 

#+RESULTS:
input valid C++: 
7 x 9 = 63

** Quick side quest: ELF 
Lets quickly see check that we have the expected result of GetNumber being UND
#+begin_src sh :results output table raw
g++ -c src/test2.cpp -o src/test2.o -I .
g++ -shared src/test2.o -o src/test2.so
readelf -s src/test2.so | head -3 | tail -2
readelf -s src/test2.so | grep "GetNumber"
#+end_src 

Here are the results listed below in this nice looking table.
#+RESULTS.
| Symbol | table | '.dynsym' | contains | 20     | entries: |     |               |
|   Num: | Value |      Size | Type     | Bind   | Vis      | Ndx | Name          |
|     9: |     0 |         0 | NOTYPE   | GLOBAL | DEFAULT  | UND | _Z9GetNumberv |
|    55: |     0 |         0 | NOTYPE   | GLOBAL | DEFAULT  | UND | _Z9GetNumberv |
There are two entries that you can see. The first is for the .dynsym table and the second is listed in the .symtab table.
The dynsym is a table that only contains global symbols. The symtab contains all symbols. A question that is often asked; why have a dynsym table that is a subset of the symtab. The answer revolves around allocable and non allocable code. The symtab contains non-allocable code that is often used by debugging tools. Think about the gnu command [[link:http://en.wikipedia.org/wiki/Strip_(Unix)][strip]], it remove unnecessary information from an executable yielding smaller binaries and possibly better performance. What is strip really doing? dumping the symtab.

lets have a quick look at it
#+begin_src sh :results output table raw
strip -s src/test2.so
readelf -s src/test2.so | head -3 | tail -2
readelf -s src/test2.so | grep "GetNumber"
#+end_src

#+RESULTS:
| Symbol | table | '.dynsym' | contains | 20     | entries: |     |               |
| Num:   | Value | Size      | Type     | Bind   | Vis      | Ndx | Name          |
| 9:     | 0     | 0         | NOTYPE   | GLOBAL | DEFAULT  | UND | _Z9GetNumberv |
So the second entry is gone. There is only the dynsym entry left. 
* Source 
Below is the source for this project
#+begin_src sh :results value raw
cd ..
tar -cvfz /tmp/cpp-stuff.tgz cpp/ 2>&1 > /dev/null
echo "[[file:./learning.tgz][Download Source]]"
#+end_src

#+RESULTS:
tar: Removing leading `/' from member names
tar: /tmp/cpp-stuff.tgz: Cannot stat: No such file or directory
tar: cpp: Cannot stat: No such file or directory
tar: Exiting with failure status due to previous errors
[[file:./learning.tgz][Download Source]]

